In [3]:
import pandas as pd
import numpy as np

In [4]:
dicc = {
    'First Score':[100, 90, np.nan, 95],
    'Second Score': [30, 45, 56, np.nan],
    'Third Score':[np.nan, 40, 80, 98]
}

In [5]:
df = pd.DataFrame(dicc)

In [6]:
df.head()

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [7]:
df.dropna()

   First Score  Second Score  Third Score
1         90.0          45.0         40.0

In [10]:
df.fillna(df.median())

   First Score  Second Score  Third Score
0        100.0          30.0         80.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0          45.0         98.0

In [12]:
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0